

#Область ОписаниеПеременных
#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПлановыеЦеныЗаполненыДляВсех(НаДату, тзНоменклатура) Экспорт
	
	ценыЗаполнены = ИСТИНА;	
	текстЗапроса = 
	"ВЫБРАТЬ
	|	ТабДок.*
	|	ПОМЕСТИТЬ ВТТабДок
	|ИЗ
	|	&ДанныеТабДок КАК ТабДок
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТабДок.Номенклатура,
	|	РЕГ.Цена КАК Цена
	|   ПОМЕСТИТЬ ВТРезультат
	|ИЗ
	|	ВТТабДок КАК ВТТабДок ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату) КАК РЕГ
	|	ПО ВТТабДок.Номенклатура = РЕГ.Номенклатура
	|;
	|
	|ВЫБРАТЬ Номенклатура ИЗ ВТРезультат ГДЕ Цена ЕСТЬ NULL";
	параметрыЗапросаМассивСтруктур = Новый Массив;
	параметрыЗапросаМассивСтруктур.Добавить( Новый Структура("Имя,Знч", "НаДату", НаДату) );
	параметрыЗапросаМассивСтруктур.Добавить( Новый Структура("Имя,Знч", "ДанныеТабДок", тзНоменклатура) );
	
	Запрос = ПолучитьЗапрос(текстЗапроса, параметрыЗапросаМассивСтруктур);	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		
		Сообщить("Для проведения документа цена должна быть заполнена: " + Выборка.Номенклатура);
		ценыЗаполнены = ЛОЖЬ;
		
	КонецЦикла;
	
	Возврат ?(ценыЗаполнены, ИСТИНА, ЛОЖЬ);
	
КонецФункции // ПлановыеЦеныЗаполненыДляВсех(Дата, Номенклатура)()

#КонецОбласти

#Область ОбработчикиСобытий

&Перед("ПередЗаписью")
Процедура КПроведения_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Отказ = НЕ ПлановыеЦеныЗаполненыДляВсех(Дата, Товары);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗапрос(текстЗапроса, параметрыЗапросаМассивСтруктур)
	
	Запрос = Новый Запрос;
	Запрос.Текст = текстЗапроса;
	
	Для Каждого парам Из параметрыЗапросаМассивСтруктур Цикл
		Запрос.УстановитьПараметр(парам.Имя, парам.Знч);
	КонецЦикла;
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область Инициализация
#КонецОбласти