

#Область ОписаниеПеременных
#КонецОбласти

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий

&Перед("ОбработкаПроведения")
Процедура КПроведения_ОбработкаПроведения(Отказ, РежимПроведения)

	Если ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("ВидБутылки");
	ОбязательныеПоля.Добавить("Акциз");
	ОбязательныеПоля.Добавить("Тара");
	ОбязательныеПоля.Добавить("Крепость");
	ОбязательныеПоля.Добавить("ВесНетто");
	ОбязательныеПоля.Добавить("ВесБрутто");
	ОбязательныеПоля.Добавить("ТипАлкогольнойЛицензииПроизводитель");    
	
	Номенклатура 	= Ссылка.Товары.ВыгрузитьКолонку("Номенклатура");	
	Ответ 			= Справочники.АлкогольДополнительныеСведения.ОбязательныеЗначенияЗаполнены(Номенклатура, ОбязательныеПоля);
	
	Если НЕ Ответ.Заполнены Тогда		
		Для Каждого инфо Из Ответ.Сообщение Цикл
			Сообщить(инфо);
		КонецЦикла;
		
		Отказ = Истина;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Область Инициализация
#КонецОбласти